# WINDOW SIZE
WINDOW_WIDTH	= 900				# 윈도우 가로 사이즈
WINDOW_HEIGHT	= 570				# 윈도우 세로 사이즈

# COORDINATE
POS_ORIGIN			= (0, 0)		# 원점 좌표
POS_INTRO_TITLE		= (177, -120)	# 인트로 타이틀 좌표
POS_INTRO_TITLE_W	= (523, 100)	# 인트로 타이틀 좌표
POS_INTRO_TOUCH		= (268, 426)	# 인트로 터치 좌표
POS_INTRO_DLG		= (220, 100)	# 인트로 다이얼로그 좌표

POS_GAME_THROW_YUT	= (514, 503)	# 윷 던지기 좌표
POS_GAME_YUT		= (240, 70)		# 윷 좌표

POS_1P_STANDING		= (55, 63)		# 스탠딩 이미지 좌표
POS_2P_STANDING		= (755, 63)		# 스탠딩 이미지 좌표
POS_3P_STANDING		= (55, 347)		# 스탠딩 이미지 좌표
POS_4P_STANDING		= (755, 347)	# 스탠딩 이미지 좌표

POS_1P_HORSE_X      = 18            # 대기열 말 좌표 (1P)
POS_1P_HORSE_Y_1    = 165           #
POS_1P_HORSE_Y_2    = 223           #
POS_2P_HORSE_X      = 716           # 대기열 말 좌표
POS_2P_HORSE_Y_1    = 165           #
POS_2P_HORSE_Y_2    = 223           #
POS_3P_HORSE_X      = 18            # 대기열 말 좌표
POS_3P_HORSE_Y_1    = 446           #
POS_3P_HORSE_Y_2    = 504           #
POS_4P_HORSE_X      = 716           # 대기열 말 좌표 (4P)
POS_4P_HORSE_Y_1    = 446           #
POS_4P_HORSE_Y_2    = 504           #

# RESULT POS
POS_RESULT_0		= (215,510)
POS_RESULT_1		= (275,510)
POS_RESULT_2		= (335,510)
POS_RESULT_3		= (395,510)
POS_RESULT_4		= (455,510)

# HORSE_POS
POS_SPRITE_HORSE = [
		[ (239, 34), (316, 34), (390, 34), (  0,  0), (470, 34), (543, 34), (618, 34) ],
		[ (239,110), (309,114), (  0,  0), (  0,  0), (  0,  0), (549,108), (618,110) ],
		[ (239,186), (  0,  0), (371,167), (  0,  0), (490,168), (  0,  0), (618,188) ],
		[ (  0,  0), (  0,  0), (  0,  0), (426,228), (  0,  0), (  0,  0), (  0,  0) ],
		[ (239,263), (  0,  0), (371,293), (  0,  0), (490,295), (  0,  0), (618,266) ],
		[ (239,335), (309,346), (  0,  0), (  0,  0), (  0,  0), (549,348), (618,338) ],
		[ (239,414), (316,414), (390,414), (  0,  0), (467,414), (543,414), (618,414) ]
	]

# GOAL_POS
POS_GOAL = [
		[ (111,111), (111,111), (111,111), (111,111), (111,111) ],
		[ (111,111), (111,111), (111,111), (111,111), (111,111) ],
		[ (111,111), (111,111), (111,111), (111,111), (111,111) ],
		[ (111,111), (111,111), (111,111), (111,111), (111,111) ]
	]

# GAMEOVER_POS
POS_GAMEOVER = (310,219)


# COLOR
BLACK		= (  0,  0,  0)
WHITE		= (255,255,255)
RED			= (255,  0,  0)
GREEN		= (0  ,255,  0)
BLUE		= (0  ,  0,255)
NAME_COLOR  = (236,177,  6)

# FPS
FPS = 30
